# Python_Hub_Studio
# Python_7_Hours

# УСЛОВНЫЕ ОПЕРАТОРЫ "if", "elif" и "else".

# Пример_1
if True:
	print("if")
elif True:
	print("elif")
else:
	print("else")
# поскольку в условии 'if' значение истинно, то дальше проверка не выполняется
# OUT: if

# Пример_2
if False:
	print("if")
elif True:
	print("elif")
else:
	print("else")
# поскольку значение в 'if' ложно, далее в 'elif' истинно, то дальше проверка не выполняется
# OUT: elif

# Пример_3
if False:
	print("if")
elif False:
	print("elif")
else:
	print("else")
# поскольку ВСЕ ('if' и 'elif') проверки не прошли
# OUT: else

# Операторы сравнения.
# значение равно
4 == 4
# значение меньше либо равно
4 <= 5
# значение больше либо  равно
4 >= 3
# значение не равно
4 != 5
# Вывод во всех приведенных выше случаях "True"


# СРАВНЕНИЕ И ВЫПОЛНЕНИЕ УСЛОВИЙ
# Пример_1
x = 0
if x == 0:
	print("if")
elif x > 0:
	print("elif")
else:
	print("else")
# поскольку в условии 'if' значение истинно, то дальше проверка не выполняется
# OUT: if

# Пример_2
x = 3
if x == 0:
	print("if")
elif x > 0:
	print("elif")
else:
	print("else")
# поскольку значение в 'if' ложно, далее в 'elif' истинно, то дальше проверка не выполняется
# OUT: elif

# Пример_3
x = -1
if x == 0:
	print("if")
elif x > 0:
	print("elif")
else:
	print("else")
# поскольку ВСЕ ('if' и 'elif') проверки не прошли
# OUT: else


# ИЗМЕНЕНИЕ ЗНАЧЕНИЯ ПЕРЕМЕННОЙ И ВЫПОЛНЕНИЕ УСЛОВИЙ
# Пример_1
x = 5
if x == 0:
	x += 1
# Условие проверки НЕ выполняется и 5 делится на значение "x", т.е. на 5
print(5/x) # OUT: 1.0

# Пример_2
x = 0
if x == 0:
	x += 1
# Условие проверки выполняется и 5 делится на значение "x", увеличенное на +1, т.е. на 1
print(5/x) # OUT: 5.0
