# Python_Hub_Studio
# Python_7_Hours

# УСЛОВНЫЕ ОПЕРАТОРЫ "if", "elif" и "else".

# В данном примере создано собственное исключение ValueError, поскольку ввод через "input" и создана
# типизация данных в int()

try:
	# вводим с клавиатуры
	x = int(input("Введите целое число: "))
	# при выполнении условия
	if x == 0:
		# переменной 'x' переприсваивается значение 1
		x = 1
		print("х был равен нулю")
	# если значение 'x' не рано 0 и тип данных 'x' - целое число
	elif type(x) == type(1):
		print("х допустимое значение")
	# актуально, если НЕ используем 'input()'. В данном случае будет сробатывать 'except'
	else:
		print("В х не допустимый тип данных")
		# значение x переприсваивается на 1
		x = 1
	print(100 / x)
except ValueError:
	print("Допущено исключение 'ValueError'")
	print("Недопустимый тип данных. Введите целое число.")
