# Python_Hub_Studio
# Python_7_Hours

# ЦИКЛ for

# алфавит кирилицы.
letters = "АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ"
letters = letters.lower() # переводим в нижний регистр

 # строка от пользователя. Итерируемая строка
string = input("Ввод текста: ") # ввести текст на русском
string = string.lower() # переводим в нижний регистр

for i in letters:
    count = 0
    for j in string:
        if i == j:
            count += 1
    if count > 0:
        print("Букв '"+str(i)+"' было "+str(count)+".")


# ЦИКЛ for

# Функция range() принимает три параметра: начало, конец, шаг.
# обозначается следующим образом: range(start, stop, step)
# Функция range(10) - это интервал от 1 до 10(НЕ ВКЛЮЧИТЕЛЬНО)
for i in range(1, 10, 2):
	# выведет на печать в столбик все нечетные числа в интервале от 1 до 10 (НЕ ВКЛЮЧИТЕЛЬНО)
	# 1 3 5 7 9
	print(i)
