# Python_Hub_Studio
# Python_7_Hours

# Передача значений между функциями.

# Программа по вычислению обьема цилиндра.
import math


# переменные-константы записываются через верхний регистр.
# Если значения переменных, которые возвращают функции присваивать переменным в глобальной
# области видимости, а также объявлять большое количества глобальных переменных, то 
# их значения будут находиться впамяти на всем протяжении работы программы, что
# засоряет память компьютера, к тому же такой код сложен для прочтения, т.е. затрудняется
# сопровождение кода и внесение в него изменений.

PI = math.pi

def radius():
    '''Функция расчета радиуса цилиндра'''
    n = float(input("Диаметр цилиндра в см: ")) # 5.6
    n = n/2
    return n


def height():
    '''Функция расчета высоты цилиндра'''
    m = float(input("Высота цилиндра в см: ")) # 10.2
    return m


def volume():
    '''Функция расчета обьема цилиндра'''
    r = radius()
    h = height()
    s = PI*r*2
    v = s*h
    return v


# print("Объема цилиндра", volume(), "см3")
# Вывод данных закомментирован за ненадобностью. Функция volume() далее вложенная.

# Далее вычислим массу цилиндра из материала, удельный вес которого берется от пользователя
def mass(g):
    '''Функция расчета массы цилиндра'''
    n = float(input("Удельный вес в г/см3: ")) # удельный вес алюминия = 2.69808
    # обьем цилиндра находится в параметре g
    return g*n/1000

# Двойной вызов функций. Сперва срабатывает вызов функции расчета обьема цилиндра volume().
# Затем срабатывает вызов функции расчета массы цилиндра mass(g).
# Обернем значение массы в функцию round(float_number, number_of_decimals) для получения значения 
# числа float_number с тремя знаками после точки.
print("Масса цилиндра", round(mass(volume()), 3), "кг") # OUT: Масса цилиндра 0.484 кг
