# Python_Hub_Studio
# Python_7_Hours

# with - as. СУТЬ ПРИМЕНЕНИЯ

# Открыть для дозаписи в конец файла. Если файла нет, создается новый
# Файл File1.txt будет содержать информацию, поскольку код выполняется без ошибок, в конце происходит
# безопасное закрытие файла r.close()
r = open("path_to_file\\File1.txt",
        "a", encoding="utf-8") # открыть для дозаписи в конец файла, кодировка "utf-8"
r.write("Информация дополнена" + "\n") # дополнить информацией
r.write("Информация снова дополнена" + "\n") # дополнить информацией
r.close() # закрыть файл
print("Программа выполнена")

# Файл File1.txt НЕ будет содержать информацию, поскольку код НЕ выполняется по причине ошибки 
# ZeroDivisionError, в конце НЕ происходит безопасное закрытие файла r.close()
r = open("path_to_file\\File1.txt",
        "a", encoding="utf-8") # открыть для дозаписи в конец файла, кодировка "utf-8"
r.write("Информация дополнена" + "\n") # дополнить информацией
2 / 0 # ZeroDivisionError
r.write("Информация снова дополнена" + "\n") # дополнить информацией
r.close() # закрыть файл
print("Программа выполнена")

# Оператор with-as открывает файл и в конце автоматически закрывает. НЕ НУЖНО прописывать r.close()
# Файл File1.txt будет содержать информацию, поскольку ператор with-as закроет файл, не смотря на
# возникновение ошибки ZeroDivisionError и в конце НЕ происходит безопасное закрытие файла r.close()
# !!!ЧТОБЫ НЕ ПЕРЕГРУЖАТЬ СТРОКАМИ И ЛИШНИМ КОДОМ ФАЙЛ ИДЕАЛЬНО ПОЛЬЗОВАТЬСЯ ТАКИМ МЕТОДОМ!!!
with open("path_to_file\\File1.txt",
        "a", encoding="utf-8") as r:
	r.write("Информация дополнена" + "\n") # дополнить информацией
	2 / 0 # ZeroDivisionError
	r.write("Информация снова дополнена" + "\n") # дополнить информацией
print("Программа выполнена")

# Файл File1.txt будет содержать информацию, поскольку код выполняется без ошибок, а также блок кода,
# который прописан в 'finally' исполняется ВСЕГДА и выполняется безопасное закрытие файла r.close()
r = open("path_to_file\\File1.txt",
        "a", encoding="utf-8") # открыть для дозаписи в конец файла, кодировка "utf-8"
try:
	r.write("Информация дополнена" + "\n") # дополнить информацией
	r.write("Информация снова дополнена" + "\n") # дополнить информацией
finally:
	r.close() # закрыть файл
print("Программа выполнена")

# Файл File1.txt будет содержать информацию, не смотря на то, что код выполняется с ошибкой
# ZeroDivisionError, блок кода, который прописан в 'finally' исполняется ВСЕГДА и выполняется безопасное
# закрытие файла r.close()
r = open("path_to_file\\File1.txt",
        "a", encoding="utf-8") # открыть для дозаписи в конец файла, кодировка "utf-8"
try:
	r.write("Информация дополнена" + "\n") # дополнить информацией
	2 / 0 # ZeroDivisionError
	r.write("Информация снова дополнена" + "\n") # дополнить информацией
finally:
	r.close() # закрыть файл
print("Программа выполнена")
